In [1]:
import pandas as pd

In [2]:
revenues = pd.Series([
    555,700,100
])

In [3]:
revenues

0    555
1    700
2    100
dtype: int64

In [4]:
revenues.values

array([555, 700, 100])

In [5]:
revenues.index

RangeIndex(start=0, stop=3, step=1)

In [6]:
city_revenues = pd.Series(
    [4200, 8000, 6500],
    index = ['Amsterdam', 'Toronto', 'Tokyo']
)
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [8]:
city_revenues['Toronto']

8000

In [9]:
city_employee_count_data = {'Amsterdam': 5, 'Tokyo': 8}
city_employee_count = pd.Series(city_employee_count_data)

In [10]:
city_employee_count

Amsterdam    5
Tokyo        8
dtype: int64

In [11]:
city_employee_count.keys()

Index(['Amsterdam', 'Tokyo'], dtype='object')

In [12]:
city_data = pd.DataFrame({
    'revenue': city_revenues,
    'employee_count': city_employee_count
})
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [13]:
city_data.axes

[Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object'),
 Index(['revenue', 'employee_count'], dtype='object')]

In [15]:
city_data.revenue

Amsterdam    4200
Tokyo        6500
Toronto      8000
Name: revenue, dtype: int64

In [16]:
city_data.loc['Amsterdam']

revenue           4200.0
employee_count       5.0
Name: Amsterdam, dtype: float64

In [17]:
city_data.iloc[1]

revenue           6500.0
employee_count       8.0
Name: Tokyo, dtype: float64

In [18]:
city_data.loc['Tokyo':'Toronto']

         revenue  employee_count
Tokyo       6500             8.0
Toronto     8000             NaN